#include "Header.h"

using namespace std;

int main()
{
	//std::string fileAddress = "C:/Users/Stark/OneDrive/个人发展战略计划/上海交通大学/科研/叶片加工/模型/采样点集/ew1312051-1/流线模型/旋转后/流线";
	//test::testIGESFileProcess(fileAddress);
	//test::testMap();
	//test::Map2D();
	test::testMain();
	//test::testVector2Diag();

	/*double a[] = { -14.8271317103068, -16.2288612441648, -15.1242838039605,
				-3.00108550936016, -2.80187433749996, -2.59871263957451,
				1.52090778549498, -0.410815700402130, -0.359965674446737,
				3.95534842970601, 1.47546694457079, 1.34583763509479};*/
	//double a[] = {-14.8271317103068,-16.2288612441648,-15.1242838039605,-15.7031424565913,-17.7892158910100,-17.8126324036279,-14.9958877514765,-15.5246706309866,
	//			-3.00108550936016,-2.80187433749996,-2.59871263957451,-2.53005662064257,-3.32842422986555,-4.09719527953407,-3.90753364293621,-2.08905845264568,
	//			1.52090778549498,-0.410815700402130,-0.359965674446737,0.255003254103276,0.255791146332054,-0.879821957489877,-0.418298866141441,-1.16425848541704,
	//			3.95534842970601, 1.47546694457079,1.34583763509479,-0.179334985754377,1.65118282449042,-0.196675865428539,-0.278063876667954,-1.16976057326753};
	////double a[] = { 1, 2, 3, 4, 5, 6 };
	//Matrix mat(4, 8, a);
	//mat.show();
	//PCAResults pcaResults = DataManipulation::PCA(mat);
	////SVDResults pcaResults = DataManipulation::SVD(mat);
	//Vector S = std::get<0>(pcaResults);
	//Matrix U = std::get<1>(pcaResults);
	//Matrix V = std::get<2>(pcaResults);
	////Vector meanVector = std::get<3>(pcaResults);
	////Matrix pc = std::get<4>(pcaResults);
	//S.show();
	//U.show();
	//V.show();
	////meanVector.show();
	//pc.show();
	return 0;
}